Museum/Documents/Посещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Посещения</Name>
			<Comment>+</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПосещения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Билеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Билет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПродажаБилетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерБилета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>6</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оценка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Museum/Documents/Посещения/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура БилетыБилетПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Билеты.ТекущиеДанные;
	СтрокаТабличнойЧасти.НомерБилета = ПолучитьНомер(СтрокаТабличнойЧасти.Билет);
КонецПроцедуры         


&НаКлиенте
Процедура ЭкспонатыНаименованиеПриИзменении(Элемент)
	
КонецПроцедуры

Функция ПолучитьНомер(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	ПродажаБилетов.НомерБилета КАК НомерБилета
	|ИЗ
	|	Документ.ПродажаБилетов КАК ПродажаБилетов
	|ГДЕ
	|	ПродажаБилетов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.НомерБилета;
	КонецЦикла;
КонецФункции
